// Написать программу, которая выводит информацию о принадлежности точки закрашенной области (по рисунку)
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	double x, y;
	int r;
	cout << "Введите координаты точки (х у):" << endl;
	cin >> x >> y;
	cout << "Введите радиус круга: ";
	cin >> r;
	if ((x * x + y * y <= r * r && ((y >= -x && y <= 3 && x <= 3) || (y <= x && y >= -3))) || (x * x + y * y >= r * r && ((y <= -x && y <= 3 && x <= 0) || (y <= x && y >= -3 && x <= 0))))
	{
		cout << "Точка с координатами (" << x << "; " << y << ") принадлежит области" << endl << endl;
	}
	else
	{
		cout << "Точка с координатами (" << x << "; " << y << ") не принадлежит области" << endl << endl;
	}
	return 0;
}